app/models/answer.rb

SELECT "answers".* FROM "answers" INNER JOIN "questions" ON "questions"."id" = "answers"."question_id" WHERE "answers"."question_id" = ?  [["question_id", 1]]
SELECT COUNT(*) FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 1]]
---
  def validate_max_answer
    errors.add('Error: У одного Вопроса может быть от 1-го до 4-х ответов') if question.answers.size > 4